{
    "name": "Piano Seminterrato",
    "number_of_gamerooms": 2,
    "gamerooms": [
      {
        "id": 0,
        "name": "Scantinato",
        "description": "Lo scantinato appare come un luogo oscuro e angusto, con pareti di pietra umida ricoperte di sporche ragnatele.\nUna debole luce penetra attraverso una minuscola finestra, offrendo appena un barlume di illuminazione.\nIl pavimento di terra battuta e' coperto di polvere e tracce di umidita'.\nGuardando meglio puoi notare: delle gabbie, una botola, un calderone, un grande tavolo in legno, un libro incantato, una lanterna spenta e una maschera.",
        "north": 1,
        "south": null,
        "east": null,
        "west": null,
        "objects": [
          {
            "name": "Maschera",
            "aliases": "",
            "pickupable": true,
            "craftable": false,
            "actions": [ 
              "Scolpita con maestria, presenta dettagli intricati che si intrecciano tra loro, evocando un senso di magia e incanto.",
              "Dopo aver indossato la maschera, si avverte una sensazione di forza crescente, pronti a fronteggiare qualsiasi nemico che si manifesti, sicuri di poterli sconfiggere senza esitazione.",
              "Dopo aver preso la maschera, la tua mano ha cominciato a muoversi autonomamente, come se fosse controllata da una forza misteriosa.\nSenza poter resistere, la mano ha avvicinato la maschera al volto del protagonista, quasi imitando il gesto iconico di Jim Carrey in The Mask, invitandolo a indossarla con una simpatia irresistibile.",
              "La maschera indossata si e' ormai fusa con il viso, impedendo qualsiasi tentativo di rimozione.\nE' come se fosse stata forgiata appositamente per proteggere colui che la porta dai pericoli magici che lo circondano, diventando una parte indivisibile del suo volto."
            ]
          },
          {
            "name": "Gabbie",
            "aliases": "",
            "pickupable": false,
            "craftable": false,
            "actions": [
              "Le gabbie vuote emanano un'atmosfera inquietante, come se fossero state recentemente abitate da creature misteriose.\nLe sbarre di ferro sono arrugginite e mostrano segni di utilizzo.",
              "Dai un calcio alle gabbie con tutte le tue forze, ma non riesci a romperle.",
              "Non riesci a prendere le gabbie. Non hai le spalle da gorilla per portarle!",
              "L'oggetto non e' contenuto nell'inventario."
            ]
          },
          {
            "name": "Botola",
            "aliases": "",
            "pickupable": false,
            "craftable": false,
            "actions": [
              "La botola nel centro dello scantinato e' un'entrata vetusta e logora verso l'ignoto.\nRealizzata in legno consunto, offre un passaggio misterioso al piano superiore, suggerendo segreti sinistri e avventure inquietanti.",
              "Stai salendo verso il piano superiore...",
              "Ma come potrebbe mai essere possibile prendere una botola?!",
              "L'oggetto non e' contenuto nell'inventario."
            ]
          },
          {
            "name": "Calderone",
            "aliases": "",
            "pickupable": false,
            "craftable": false,
            "actions": [
              "Il calderone emana un'aria di mistero e potere oscuro. E' un imponente recipiente di ferro nero, con pareti robuste e segni di bruciature passate.\nResidui di fumo secco si insinuano tra le sue crepe, evocando immagini di incantesimi e pozioni magiche. Attorno al calderone, boccette vuote giacciono a terra, testimoni di antichi elisir e miscele misteriose.",
              "Ti accorgi che e' vuoto! Sembra che qualcuno abbia gia' fatto incantesimi di sparizione sulla pozione che conteneva!",
              "Provi a prendere il calderone ma decidi subito di lasciarlo. Meglio lasciar perdere e risparmiare le energie per altre imprese!",
              "L'oggetto non e' contenuto nell'inventario."
            ]
          },
          {
            "name": "Tavolo",
            "aliases": "",
            "pickupable": false,
            "craftable": false,
            "actions": [
              "Antico mobile di legno intagliato, segnato dal passare del tempo.\nLa sua superficie e' cosi' ben coperta che potrebbe essere un concorrente al titolo di 'Miglior tavolo coperto di polvere del decennio'.",
              "Il tavolo e' cosi' carico di oggetti che anche un leggero spostamento potrebbe scatenare una catastrofe a effetto domino! Meglio lasciarlo stare!",
              "Il tavolo e' fissato a terra, non puo' essere preso.",
              "L'oggetto non e' contenuto nell'inventario."
            ]
          },
          {
            "name": "Libro Incantato",
            "aliases": "Libro",
            "pickupable": true,
            "craftable": true, 
            "actions": [
              "Posizionato al centro del tavolo ha un aspetto usurato, con pagine ingiallite e bordi consumati, testimoni del suo utilizzo intenso nel corso degli anni.\nForse bisognerebbe sfogliarlo..",
              "Man mano che si sfoglia il libro, diventa evidente che i caratteri utilizzati per la scrittura sono del tutto incomprensibili, come se appartenessero a una lingua sconosciuta.",
              "Questo potrebbe essere utile in seguito, il libro e' inserito nell'inventario.",
              "L'oggetto e' rimosso dall'inventario."
            ]
          },
          {
            "name": "Lanterna Spenta",
            "aliases": "Lanterna",
            "pickupable": true,
            "craftable": false, 
            "actions": [
              "Questa lanterna appare come un oggetto ormai dimenticato, coperto di polvere.\nI suoi vetri opachi nascondono una luce che non brilla piu'.",
              "Cerchi di accendere la lanterna, ma non riesci a trovare l'accendino che avevi in tasca prima di essere catturato",
              "Anche se spenta, potrebbe tornare utile in seguito, la lanterna e' inserita nell'inventario.",
              "L'oggetto e' rimosso dall'inventario."
            ]
          }
        ]
      }
    ]
  }